import FormCosultant from "@/components/cosultant/form";
import Image from "next/image";
import { FaNewspaper } from "react-icons/fa";

const Home = () => {
  return (
    <main className="p-4 space-y-10 pb-20 py-8 flex flex-col gap-8">
      <div className="flex flex-col justify-center items-center gap-4">
        <span className="flex text-sm items-center gap-1 rounded-lg w-max bg-slate-100 px-3 py-1">
          <FaNewspaper className="fill-red-600 size-3" />
          درباره یکتیوبر
        </span>
        <h1 className="flex font-bold text-3xl items-center text-center">
          میخوام داستان یکتیوبر را برات بگم!
        </h1>
        <p className="text-slate-600 leading-7 md:w-1/2 text-center text-sm mt-8">
          از اینکه چی شد اصلا یکتیوبر ساخته شد ، تا الان چه کار هایی انجام
          دادیمو واسه آینده میخوایم چه پلن هایی رو براتون رو نمایی کنیم.
        </p>

        {/* --------------------------cardSection number1111111------------------------------- */}
        <div className="mt-52 rounded-3xl bg-red-600 w-full h-full flex flex-col gap-4 p-4 md:flex-row relative">
          <div className="absolute -top-[25%] md:-top-[90%] left-0 flex flex-row-reverse items-center gap-4">
            <div className="relative md:w-80 w-52 aspect-square">
              <Image
                src="/assets/images/avatar-man.png"
                alt=""
                fill
                className="object-contain"
              />
            </div>
            <svg
              className="md:w-36 w-20 aspect-square"
              viewBox="0 0 197 163"
              fill="none"
            >
              <path
                d="M0.883021 8.919C0.334528 8.98361 -0.05774 9.48062 0.00686556 10.0291C0.0714712 10.5776 0.568486 10.9699 1.11698 10.9053L0.883021 8.919ZM188.293 162.707C188.683 163.098 189.317 163.098 189.707 162.707L196.071 156.343C196.462 155.953 196.462 155.319 196.071 154.929C195.681 154.538 195.047 154.538 194.657 154.929L189 160.586L183.343 154.929C182.953 154.538 182.319 154.538 181.929 154.929C181.538 155.319 181.538 155.953 181.929 156.343L188.293 162.707ZM1.11698 10.9053L70.0401 2.78699L69.8062 0.800718L0.883021 8.919L1.11698 10.9053ZM84.9135 21.2535L65.6027 77.2715L67.4935 77.9233L86.8043 21.9053L84.9135 21.2535ZM84.4084 98.0572L170.781 77.6485L170.321 75.7021L83.9485 96.1108L84.4084 98.0572ZM188 91.2733V162H190V91.2733H188ZM170.781 77.6485C179.572 75.5712 188 82.24 188 91.2733H190C190 80.9495 180.368 73.328 170.321 75.7021L170.781 77.6485ZM65.6027 77.2715C61.4944 89.189 72.1405 100.956 84.4084 98.0572L83.9485 96.1108C73.2141 98.6472 63.8988 88.3512 67.4935 77.9233L65.6027 77.2715ZM70.0401 2.78699C80.2885 1.57985 88.2766 11.4977 84.9135 21.2535L86.8043 21.9053C90.6478 10.7558 81.5186 -0.578861 69.8062 0.800718L70.0401 2.78699Z"
                fill="black"
              />
            </svg>
          </div>
          <p
            className="md:w-1/4 w-[70%] bg-white absolute bottom-0 right-0 h-14 rounded-tl-3xl 
            after:absolute after:size-8 after:block after:bg-transparent after:bottom-0 after:-left-8 after:rounded-br-full after:shadow-[9px_9px_0_8px_rgba(255,255,255,1)] 
            before:absolute before:size-8 before:block before:bg-transparent before:-top-8 before:-right-0 before:rounded-br-full before:shadow-[9px_10px_0_9px_rgba(255,255,255,1)]"
          ></p>
          <div className="flex flex-col-reverse md:flex-row items-start md:justify-between gap-4 ">
            <div className="w-full md:w-1/3 relative aspect-video">
              <Image
                src="/assets/images/avatar-boy.png"
                alt=""
                fill
                className="object-contain mix-blend-luminosity -mt-16 md:mt-0"
              />
            </div>
            <div className="flex flex-col gap-5 w-full md:w-2/3 justify-around h-full py-8 ">
              <h1 className="text-center text-white font-bold w-full">
                همه چی برمیگرده به سال ۱۳۹۹ ... 😷
              </h1>
              <p className="text-sm leading-10 text-white">
                تولید محتوا در یوتیوبیک فعالیت هیجان‌انگیز است که در کنار
                جذابیت‌هایش، مشکلات و فوت ‌و فن‌های خودش راهم دارد: از اینکه
                چطور محتوای مخاطب‌پسند تولید کنیم گرفته تا چه کارهایی باعثاخطار
                و استرایک گرفتن می‌شوند و اصلاً اگر به درآمد یوتیوبی رسیدیم،
                حالا چطور آنرا نقد کنیم و... . یک‌تیوبر تیمی از حرفه‌ای‌های کسب
                درآمد از یوتیوب دارد که باکوله‌باری از تجربۀ یوتیوبی، آماده‌اند
                تا کاملاً رایگان برای حل مشکلات یوتیوبرهاکنارشان باشند. اگر نیاز
                به مشاوره و راهنمایی دارید، ما در کنار شما هستیم!
              </p>
            </div>
          </div>
          <div className="flex items-center font-bold absolute right-14 md:right-20 -bottom-1">
            بعدش...
            <svg width="80" height="49" viewBox="0 0 80 49" fill="none">
              <path
                d="M4.63793 48.0803C4.89689 48.1762 5.18456 48.044 5.28046 47.7851L6.84333 43.5652C6.93924 43.3062 6.80706 43.0186 6.54811 42.9227C6.28916 42.8268 6.00149 42.9589 5.90558 43.2179L4.51636 46.9689L0.765353 45.5797C0.5064 45.4838 0.21873 45.616 0.122825 45.8749C0.0269187 46.1339 0.159095 46.4215 0.418048 46.5174L4.63793 48.0803ZM79.0943 5.71817C60.393 -5.71966 39.9477 3.01426 28.6786 12.3576C25.8529 14.7005 23.5827 17.0975 22.0449 19.2515C21.2762 20.3283 20.6837 21.3539 20.298 22.2896C19.9148 23.2194 19.7214 24.095 19.7934 24.8584C19.8676 25.6444 20.2253 26.305 20.9037 26.7341C21.558 27.1479 22.454 27.3106 23.5511 27.2552C25.7434 27.1446 28.9743 26.1495 33.3825 24.0309L32.9493 23.1296C28.5713 25.2337 25.4878 26.1562 23.5007 26.2565C22.5081 26.3066 21.8482 26.1482 21.4383 25.8889C21.0525 25.6449 20.8377 25.2806 20.789 24.7645C20.7382 24.2259 20.8715 23.5224 21.2225 22.6707C21.5711 21.825 22.1203 20.8669 22.8588 19.8325C24.3355 17.7641 26.5414 15.4287 29.3169 13.1275C40.4528 3.89448 60.4139 -4.53468 78.5726 6.57127L79.0943 5.71817ZM33.3825 24.0309C37.7836 21.9158 40.4578 20.1001 41.7326 18.5895C42.3701 17.8341 42.7183 17.0831 42.6619 16.3607C42.6036 15.6122 42.1261 15.0476 41.4619 14.6501C40.8037 14.256 39.9088 13.989 38.8631 13.8272C37.8106 13.6643 36.5726 13.6031 35.2049 13.6421C32.4694 13.72 29.1808 14.1994 25.7554 15.0973C18.9176 16.8896 11.4463 20.3733 6.73606 25.7612C4.37474 28.4623 2.70188 31.6489 2.16395 35.3395C1.62598 39.0305 2.22869 43.1876 4.35725 47.8202L5.26592 47.4027C3.20383 42.9147 2.6479 38.9525 3.1535 35.4838C3.65915 32.0146 5.23206 29.001 7.48892 26.4194C12.015 21.2422 19.2697 17.8311 26.0089 16.0646C29.372 15.1831 32.5847 14.7171 35.2334 14.6417C36.5579 14.6039 37.7328 14.6641 38.7102 14.8154C39.6943 14.9677 40.4463 15.2076 40.9483 15.5081C41.4443 15.805 41.6403 16.1225 41.665 16.4384C41.6916 16.7804 41.5325 17.2761 40.9684 17.9446C39.84 19.2817 37.3345 21.0221 32.9493 23.1296L33.3825 24.0309Z"
                fill="url(#paint0_linear_1_1062)"
              />
              <defs>
                <linearGradient
                  id="paint0_linear_1_1062"
                  x1="36.3775"
                  y1="37.8421"
                  x2="83.9331"
                  y2="24.948"
                  gradientUnits="userSpaceOnUse"
                >
                  <stop />
                  <stop offset="1" stopColor="#666666" stopOpacity="0.2" />
                </linearGradient>
              </defs>
            </svg>
          </div>
        </div>

        {/* --------------------------cardSection number222222------------------------------- */}

        <div className="mt-8 rounded-3xl bg-slate-100 w-full h-full flex flex-col md:items-start gap-4 p-4 md:flex-row relative">
          <p
            className="md:w-1/4 w-[70%] bg-white absolute bottom-0 left-0 h-14 rounded-tr-3xl 
        after:absolute after:size-8 after:block after:bg-transparent after:-top-8 after:left-0 after:rounded-bl-full after:shadow-[-9px_9px_0_9px_rgba(255,255,255,1)] 
        before:absolute before:size-8 before:block before:transparent before:bottom-0 before:-right-8 before:rounded-bl-full before:shadow-[-9px_9px_0_9px_rgba(255,255,255,1)]"
          ></p>
          <div className="flex md:flex-row-reverse flex-col-reverse items-start md:justify-between gap-4 ">
            <div className="w-full md:w-1/3 relative aspect-video">
              <Image
                src="/assets/images/avatar-women.png"
                alt=""
                fill
                className="object-contain -mt-14 md:mt-0"
              />
            </div>
            <div className="flex flex-col gap-5 w-full md:w-2/3 justify-around h-full py-8">
              <h1 className="text-center text-black font-bold w-full">
                {" "}
                🤔 بعدش به این فکر افتادیم که چطور حلش کنیم؟{" "}
              </h1>
              <p className="text-sm leading-10 text-black">
                تولید محتوا در یوتیوبیک فعالیت هیجان‌انگیز است که در کنار
                جذابیت‌هایش، مشکلات و فوت ‌و فن‌های خودش راهم دارد: از اینکه
                چطور محتوای مخاطب‌پسند تولید کنیم گرفته تا چه کارهایی باعثاخطار
                و استرایک گرفتن می‌شوند و اصلاً اگر به درآمد یوتیوبی رسیدیم،
                حالا چطور آنرا نقد کنیم و... . یک‌تیوبر تیمی از حرفه‌ای‌های کسب
                درآمد از یوتیوب دارد که باکوله‌باری از تجربۀ یوتیوبی، آماده‌اند
                تا کاملاً رایگان برای حل مشکلات یوتیوبرهاکنارشان باشند. اگر نیاز
                به مشاوره و راهنمایی دارید، ما در کنار شما هستیم!{" "}
              </p>
            </div>
          </div>
          <div className="flex items-center font-bold absolute -bottom-10 left-14">
            و حالا...
            <svg width="112" height="78" viewBox="0 0 112 78" fill="none">
              <path
                d="M111.486 75.8798C111.552 76.1478 111.389 76.4189 111.121 76.4854L106.753 77.5682C106.485 77.6347 106.214 77.4713 106.147 77.2032C106.081 76.9352 106.244 76.6641 106.512 76.5976L110.395 75.6351L109.432 71.7526C109.366 71.4846 109.529 71.2134 109.797 71.147C110.065 71.0806 110.336 71.244 110.403 71.512L111.486 75.8798ZM0.128825 10.0855C28.7868 -9.41531 59.3384 4.11452 76.0316 19.0625C80.2125 22.8063 83.5446 26.6549 85.776 30.1232C87.9901 33.5648 89.1791 36.722 88.922 39.0551C88.7904 40.2497 88.2761 41.2464 87.3202 41.9178C86.3804 42.578 85.0739 42.8813 83.4311 42.8334C80.1544 42.7377 75.325 41.2379 68.7317 37.919L69.1813 37.0258C75.7421 40.3283 80.4099 41.7447 83.4603 41.8338C84.9811 41.8782 86.0458 41.591 86.7454 41.0995C87.429 40.6193 87.8225 39.9032 87.9281 38.9456C88.1453 36.9741 87.1255 34.0691 84.935 30.6643C82.7617 27.2863 79.4932 23.5045 75.3645 19.8074C58.8194 4.99205 28.7896 -8.20765 0.6914 10.9123L0.128825 10.0855ZM68.7317 37.919C62.1596 34.6108 57.1759 32.3018 53.5743 30.8453C51.7729 30.1169 50.3259 29.6052 49.2037 29.2884C48.0653 28.9669 47.3137 28.8619 46.878 28.9018C46.6609 28.9217 46.5927 28.9718 46.5846 28.9792C46.5845 28.9793 46.5882 28.9747 46.5895 28.9708C46.5899 28.9697 46.5841 28.9852 46.5873 29.0271C46.5943 29.1199 46.6402 29.2811 46.7711 29.5238C46.8985 29.7603 47.0899 30.0437 47.35 30.3738C48.3979 31.7039 50.419 33.6168 53.2458 35.981C64.5312 45.4199 88.1715 61.658 111.258 75.5718L110.742 76.4283C87.6367 62.5033 63.9467 46.2347 52.6042 36.7481C49.774 34.3809 47.682 32.4112 46.5645 30.9927C46.2832 30.6357 46.0549 30.3028 45.8908 29.9983C45.73 29.7001 45.6124 29.3957 45.5902 29.1026C45.5664 28.7894 45.6537 28.4723 45.9146 28.2368C46.1522 28.0224 46.4704 27.935 46.7867 27.906C47.4179 27.8481 48.3209 28 49.4754 28.326C50.6462 28.6566 52.1304 29.1828 53.9492 29.9182C57.5876 31.3896 62.5991 33.7125 69.1813 37.0258L68.7317 37.919Z"
                fill="url(#paint0_linear_1_1063)"
              />
              <defs>
                <linearGradient
                  id="paint0_linear_1_1063"
                  x1="63.5312"
                  y1="61.1199"
                  x2="-8.05448"
                  y2="41.7103"
                  gradientUnits="userSpaceOnUse"
                >
                  <stop />
                  <stop offset="1" stopColor="#666666" stopOpacity="0.2" />
                </linearGradient>
              </defs>
            </svg>
          </div>
        </div>
        <h1 className="font-bold text-2xl text-center mt-10">همه چیز برای <strong className="underline underline-offset-[12px] text-red-600 text-3xl">شروع</strong> محیاست...</h1>
        <p className="text-sm text-slate-500">شما هم اگه دوست دارین وارد این جمع بشین، فرم زیر رو همین حالا پر کنین تا ما سریع باهاتون تماس بگیریم.</p>
        <FormCosultant />
      </div>
    </main>
  );
};

export default Home;
